; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	image2 - mode
	infrared0 - mode
	thermograph1 - mode
	Star3 - direction
	Star4 - direction
	Star2 - direction
	Star1 - direction
	Star5 - direction
	Star0 - direction
	GroundStation6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Planet14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation6)
	(supports instrument3 image2)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star0)
	(supports instrument4 thermograph1)
	(supports instrument4 image2)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star5)
	(supports instrument6 infrared0)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 Star1)
	(supports instrument7 thermograph1)
	(supports instrument7 image2)
	(supports instrument7 infrared0)
	(calibration_target instrument7 GroundStation6)
	(calibration_target instrument7 Star0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
)
(:goal (and
	(have_image Planet7 infrared0)
	(have_image Planet8 thermograph1)
	(have_image Star9 infrared0)
	(have_image Star10 infrared0)
	(have_image Planet11 image2)
	(have_image Phenomenon12 thermograph1)
	(have_image Planet13 thermograph1)
	(have_image Planet14 infrared0)
	(have_image Phenomenon15 image2)
))

)

; plan
1. (turn_to satellite1 star0 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star0)
   goals met: 0 of 9
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 9
3. (calibrate satellite1 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 0 of 9
4. (turn_to satellite1 planet11 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet11)
   goals met: 0 of 9
5. (take_image satellite1 planet11 instrument4 image2)
   added: (have_image planet11 image2)
   goals met: 1 of 9
6. (turn_to satellite1 phenomenon15 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon15)
   goals met: 1 of 9
7. (take_image satellite1 phenomenon15 instrument4 image2)
   added: (have_image phenomenon15 image2)
   goals met: 2 of 9
8. (turn_to satellite1 phenomenon12 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon12)
   goals met: 2 of 9
9. (take_image satellite1 phenomenon12 instrument4 thermograph1)
   added: (have_image phenomenon12 thermograph1)
   goals met: 3 of 9
10. (turn_to satellite1 planet13 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 planet13)
   goals met: 3 of 9
11. (take_image satellite1 planet13 instrument4 thermograph1)
   added: (have_image planet13 thermograph1)
   goals met: 4 of 9
12. (turn_to satellite1 planet14 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet14)
   goals met: 4 of 9
13. (take_image satellite1 planet14 instrument4 infrared0)
   added: (have_image planet14 infrared0)
   goals met: 5 of 9
14. (turn_to satellite1 planet7 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet7)
   goals met: 5 of 9
15. (take_image satellite1 planet7 instrument4 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 6 of 9
16. (turn_to satellite1 planet8 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet8)
   goals met: 6 of 9
17. (take_image satellite1 planet8 instrument4 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 7 of 9
18. (turn_to satellite1 star10 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star10)
   goals met: 7 of 9
19. (take_image satellite1 star10 instrument4 infrared0)
   added: (have_image star10 infrared0)
   goals met: 8 of 9
20. (turn_to satellite1 star9 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star9)
   goals met: 8 of 9
21. (take_image satellite1 star9 instrument4 infrared0)
   added: (have_image star9 infrared0)
   goals met: 9 of 9
